---
kind: method
id: M:Autodesk.Revit.DB.FilterableValueProvider.GetIntegerValue(Autodesk.Revit.DB.Element)
source: html/264c88c0-e52e-e9e2-c268-fc58b2b92111.htm
---
# Autodesk.Revit.DB.FilterableValueProvider.GetIntegerValue Method

Gets an integer value from the given element.

## Syntax (C#)
```csharp
public int GetIntegerValue(
	Element element
)
```

## Parameters
- **element** (`Autodesk.Revit.DB.Element`) - The element to query.

## Returns
The integer value from the element.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null